cases/Case02/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//1)---------------------------------------------------------------------------------------------------
// Basic control
// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers	false;

// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface

//2)---------------------------------------------------------------------------------------------------
//Qui definisco la mia target surface presente in triSurface folder
geometry
{
    insieme.stl
    {
        type triSurfaceMesh;  //Questo è il tipo di file, siccome uso STL devo mettere questo
        name reactingWall;
    }
/*
    point1
    {
        type searchableSphere;
        centre (7.2 0.5 9);
        radius 0.5;
    }
    point2
    {
        type searchableSphere;
        centre (7.2 0.5 5);
        radius 0.5;
    }
    point3
    {
        type searchableSphere;
        centre (11.6 0.5 9);
        radius 0.5;
    }
    point4
    {
        type searchableSphere;
        centre (11.6 0.5 5);
        radius 0.5;
    }
*/
};


//3)---------------------------------------------------------------------------------------------------
// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 1000000; //Quando stai facendo il refine, se supero questo fermati

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 4000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 10;
  
    maxLoadUnbalance 0.10;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 2; //Questo controlla il modo in cui il refine viene fatto. Se metto 2 ho due layer di celle prima di passare 
                           //dal livello al livello n+1



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features  
    ( 
/*
        {
            file "ahmedBody.eMesh";
		    level 2;  //indica il livello di refinement nelle celle vicini ai lati che ho selezionato col comando surface
	}
*/
    );


    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
	reactingWall
        {
            // Surface-wise min and max refinement level
            level (3 3);
        }
    }

    // Resolve sharp angles on fridges
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes:
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

   refinementRegions
    {
/*
      point1
        {
            mode inside;  //nel box definito all'inizio uso una precisione di fissata qui. posso mettere
                          //insiede: dentro il box
                          //outiste: fuori dal box
                          //distance: indica la distanza level(("distanza" "livello"))
            levels ((5 5));
        }
      point2
        {
            mode inside;  //nel box definito all'inizio uso una precisione di fissata qui. posso mettere
                          //insiede: dentro il box
                          //outiste: fuori dal box
                          //distance: indica la distanza level(("distanza" "livello"))
            levels ((5 5));
        }
      point3
        {
            mode inside;  //nel box definito all'inizio uso una precisione di fissata qui. posso mettere
                          //insiede: dentro il box
                          //outiste: fuori dal box
                          //distance: indica la distanza level(("distanza" "livello"))
            levels ((5 5));
        }
      point4
        {
            mode inside;  //nel box definito all'inizio uso una precisione di fissata qui. posso mettere
                          //insiede: dentro il box
                          //outiste: fuori dal box
                          //distance: indica la distanza level(("distanza" "livello"))
            levels ((5 5));
        }
*/
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    //locationInMesh (0 -15 125);
    locationInMesh (0.00001	1.000001	-0.0999999); //deve essere dentro la cella e non sulla faccia
    

    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 1; // fa uno smooth prima ti attirare punti su superficie

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 1.0; // indica che solo i punti ad una distanza pari ad un lato sono attratti sulla superficie,
                   // se tolerance > 1.0 attiro anche quelli più lontani

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 10; //indica il numero di celle che attiro verso la superficie

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 6; //quando attiro la mesh peggiora, allora mi fermo e torno indietro con un fattore correttivo e ricomincio

   // nFeatureSnapIter 10;
}



// Settings for the layer addition.
//viene fatta dopo la snappatura
addLayersControls  //estrude le celle lungo la patch ottenute da .stl
{
    // Per final patch (so not geometry!) the layer information
    layers
    {
        reactingwall                       //questi nomi sono patch,non regioni, quindi è il mio reactingwall
        {  nSurfaceLayers 3; }                                      
      
    }

    // Expansion factor for layer mesh
    expansionRatio 1.1;

    //- Wanted thickness of final added cell layer. If multiple layers
    //  is the
    //  thickness of the layer furthest away from the wall.
    //  Relative to undistorted size of cell outside layer.
    //  is the thickness of the layer furthest away from the wall.
    //  See relativeSizes parameter.
    // 332  finalLayerThickness 0.5;
    finalLayerThickness 0.001;  //se è assoluto indica che l'ultimo layer prima della mia patch è ampio 0.001

    //- Minimum thickness of cell layer. If for any reason layer
    //  cannot be above minThickness do not add layer.
    //  Relative to undistorted size of cell outside layer.
    //  See relativeSizes parameter.
    minThickness 0.0001;

    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes false;   //indica se finalLayerThicknessè absoluto e relativo

    //- If points get not extruded do nGrow layers of connected faces that are
    //  also not grown. This helps convergence of the layer addition process
    //  close to features.
    nGrow 0;


    // Advanced settings

    //- When not to extrude surface. 0 is flat surface, 90 is when two faces
    //  make straight angle.
    featureAngle 180;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30;


    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 1;

    // Smooth layer thickness over surface patches
    nSmoothThickness 1;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 1.0;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    //maxThicknessToMedialRatio 0.3;
    maxThicknessToMedialRatio 1.0;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 16x! 90 degrees corresponds to 130 in 16x.
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;

    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 10;

    meshQualityControls::relaxed.
    nRelaxedIter 20;
    
    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    //- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 50;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-15;
    
    //- Minimum face area. Set to <0 to disable.
    //minArea -1;
    minArea 1e-13;

    //- Minimum tet volume. Is absolute volume of the tet formed by the
    //  face-centre decomposition triangle and the cell centre.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    //minTetVol 1e-20;

    minTetVol -1e30;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. This has to be a positive number for tracking
    //  to work. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
   
    minTetQuality 1e-50;
   
    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //- and face centre triangles normal
    //minTwist 0.05;
    minTwist 0.05;
    
    //- minimum normalised cell determinant
    //- 1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
//    minFaceWeight 0.03;
    minFaceWeight 0.05;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;

   //minVolCollapseRatio 0.5;


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }

}


// Advanced

// Flags for optional output
// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1E-6;


// ************************************************************************* //
