cases/Case02/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2e-08/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          208;
        startFace       49206;
    }
    outlet
    {
        type            patch;
        nFaces          208;
        startFace       49414;
    }
    inertWall
    {
        type            wall;
        nFaces          1504;
        startFace       49622;
    }
    reactingWall
    {
        type            wall;
        nFaces          4660;
        startFace       51126;
    }
)

// ************************************************************************* //
